/* С помощью цикла while найдите факториал числа 10 и присвойте его переменной factorial

  Справка:
  Факториал числа 𝑛 (обозначается как 𝑛!)  — это произведение всех натуральных чисел от 1 до 𝑛 включительно.
  Например, факториал числа 3 это 1 * 2 * 3 (6).
*/

// your code
let factorial = 1;
let number = 10; // Число, чей факториал ищем;

if(number>0){            // Проверка того что число натуральное
    while(number>=1){
        factorial*=number;
        number--;
    }
}
else{
    console.log(`Factorial of this number cannot be found`)
}
